7767517
169 199
Input            data             0 1 data 0=3 1=1024 2=1024
Split            splitncnn_0      1 6 data data_splitncnn_0 data_splitncnn_1 data_splitncnn_2 data_splitncnn_3 data_splitncnn_4 data_splitncnn_5
Convolution      conv1            1 1 data_splitncnn_5 conv1 0=24 1=7 2=1 3=4 4=0 5=1 6=3528
BatchNorm        conv1/bn         1 1 conv1 conv1_conv1/bn 0=24
Split            splitncnn_1      1 2 conv1_conv1/bn conv1_conv1/bn_splitncnn_0 conv1_conv1/bn_splitncnn_1
Power            conv1/neg        1 1 conv1_conv1/bn_splitncnn_1 conv1/neg 0=1.000000 1=-1.000000 2=0.000000
Concat           conv1/concat     2 1 conv1_conv1/bn_splitncnn_0 conv1/neg conv1_CR 0=0
Scale            conv1/scale      1 1 conv1_CR conv1_CR_conv1/scale 0=48 1=1
ReLU             conv1/relu       1 1 conv1_CR_conv1/scale conv1_CR_conv1/relu 0=0.000000
Pooling          pool1            1 1 conv1_CR_conv1/relu pool1 0=0 1=3 2=2 3=0 4=0
Convolution      conv2            1 1 pool1 conv2 0=64 1=5 2=1 3=2 4=0 5=1 6=76800
BatchNorm        conv2/bn         1 1 conv2 conv2_conv2/bn 0=64
Split            splitncnn_2      1 2 conv2_conv2/bn conv2_conv2/bn_splitncnn_0 conv2_conv2/bn_splitncnn_1
Power            conv2/neg        1 1 conv2_conv2/bn_splitncnn_1 conv2/neg 0=1.000000 1=-1.000000 2=0.000000
Concat           conv2/concat     2 1 conv2_conv2/bn_splitncnn_0 conv2/neg conv2_CR 0=0
Scale            conv2/scale      1 1 conv2_CR conv2_CR_conv2/scale 0=128 1=1
ReLU             conv2/relu       1 1 conv2_CR_conv2/scale conv2_CR_conv2/relu 0=0.000000
Pooling          pool2            1 1 conv2_CR_conv2/relu pool2 0=0 1=3 2=2 3=0 4=0
Split            splitncnn_3      1 4 pool2 pool2_splitncnn_0 pool2_splitncnn_1 pool2_splitncnn_2 pool2_splitncnn_3
Convolution      conv3/incep0/conv 1 1 pool2_splitncnn_3 conv3/incep0/conv 0=32 1=1 2=1 3=1 4=0 5=1 6=4096
BatchNorm        conv3/incep0/bn  1 1 conv3/incep0/conv conv3/incep0/conv_conv3/incep0/bn 0=32
Scale            conv3/incep0/bn_scale 1 1 conv3/incep0/conv_conv3/incep0/bn conv3/incep0/conv_conv3/incep0/bn_scale 0=32 1=1
ReLU             conv3/incep0/relu 1 1 conv3/incep0/conv_conv3/incep0/bn_scale conv3/incep0/conv_conv3/incep0/relu 0=0.000000
Convolution      conv3/incep1/conv1 1 1 pool2_splitncnn_2 conv3/incep1/conv1 0=24 1=1 2=1 3=1 4=0 5=1 6=3072
BatchNorm        conv3/incep1/bn1 1 1 conv3/incep1/conv1 conv3/incep1/conv1_conv3/incep1/bn1 0=24
Scale            conv3/incep1/bn_scale1 1 1 conv3/incep1/conv1_conv3/incep1/bn1 conv3/incep1/conv1_conv3/incep1/bn_scale1 0=24 1=1
ReLU             conv3/incep1/relu1 1 1 conv3/incep1/conv1_conv3/incep1/bn_scale1 conv3/incep1/conv1_conv3/incep1/relu1 0=0.000000
Convolution      conv3/incep1/conv2 1 1 conv3/incep1/conv1_conv3/incep1/relu1 conv3/incep1/conv2 0=32 1=3 2=1 3=1 4=1 5=1 6=6912
BatchNorm        conv3/incep1/bn2 1 1 conv3/incep1/conv2 conv3/incep1/conv2_conv3/incep1/bn2 0=32
Scale            conv3/incep1/bn_scale2 1 1 conv3/incep1/conv2_conv3/incep1/bn2 conv3/incep1/conv2_conv3/incep1/bn_scale2 0=32 1=1
ReLU             conv3/incep1/relu2 1 1 conv3/incep1/conv2_conv3/incep1/bn_scale2 conv3/incep1/conv2_conv3/incep1/relu2 0=0.000000
Convolution      conv3/incep2/conv1 1 1 pool2_splitncnn_1 conv3/incep2/conv1 0=24 1=1 2=1 3=1 4=0 5=1 6=3072
BatchNorm        conv3/incep2/bn1 1 1 conv3/incep2/conv1 conv3/incep2/conv1_conv3/incep2/bn1 0=24
Scale            conv3/incep2/bn_scale1 1 1 conv3/incep2/conv1_conv3/incep2/bn1 conv3/incep2/conv1_conv3/incep2/bn_scale1 0=24 1=1
ReLU             conv3/incep2/relu1 1 1 conv3/incep2/conv1_conv3/incep2/bn_scale1 conv3/incep2/conv1_conv3/incep2/relu1 0=0.000000
Convolution      conv3/incep2/conv2 1 1 conv3/incep2/conv1_conv3/incep2/relu1 conv3/incep2/conv2 0=32 1=3 2=1 3=1 4=1 5=1 6=6912
BatchNorm        conv3/incep2/bn2 1 1 conv3/incep2/conv2 conv3/incep2/conv2_conv3/incep2/bn2 0=32
Scale            conv3/incep2/bn_scale2 1 1 conv3/incep2/conv2_conv3/incep2/bn2 conv3/incep2/conv2_conv3/incep2/bn_scale2 0=32 1=1
ReLU             conv3/incep2/relu2 1 1 conv3/incep2/conv2_conv3/incep2/bn_scale2 conv3/incep2/conv2_conv3/incep2/relu2 0=0.000000
Convolution      conv3/incep2/conv3 1 1 conv3/incep2/conv2_conv3/incep2/relu2 conv3/incep2/conv3 0=32 1=3 2=1 3=1 4=1 5=1 6=9216
BatchNorm        conv3/incep2/bn3 1 1 conv3/incep2/conv3 conv3/incep2/conv3_conv3/incep2/bn3 0=32
Scale            conv3/incep2/bn_scale3 1 1 conv3/incep2/conv3_conv3/incep2/bn3 conv3/incep2/conv3_conv3/incep2/bn_scale3 0=32 1=1
ReLU             conv3/incep2/relu3 1 1 conv3/incep2/conv3_conv3/incep2/bn_scale3 conv3/incep2/conv3_conv3/incep2/relu3 0=0.000000
Pooling          conv3/incep3/pool 1 1 pool2_splitncnn_0 conv3/incep3/pool 0=0 1=3 2=1 3=1 4=0
Convolution      conv3/incep3/conv 1 1 conv3/incep3/pool conv3/incep3/conv 0=32 1=1 2=1 3=1 4=0 5=1 6=4096
BatchNorm        conv3/incep3/bn  1 1 conv3/incep3/conv conv3/incep3/conv_conv3/incep3/bn 0=32
Scale            conv3/incep3/bn_scale 1 1 conv3/incep3/conv_conv3/incep3/bn conv3/incep3/conv_conv3/incep3/bn_scale 0=32 1=1
ReLU             conv3/incep3/relu 1 1 conv3/incep3/conv_conv3/incep3/bn_scale conv3/incep3/conv_conv3/incep3/relu 0=0.000000
Concat           conv3/incep      4 1 conv3/incep0/conv_conv3/incep0/relu conv3/incep1/conv2_conv3/incep1/relu2 conv3/incep2/conv3_conv3/incep2/relu3 conv3/incep3/conv_conv3/incep3/relu conv3/incep 0=0
Split            splitncnn_4      1 4 conv3/incep conv3/incep_splitncnn_0 conv3/incep_splitncnn_1 conv3/incep_splitncnn_2 conv3/incep_splitncnn_3
Convolution      conv4/incep0/conv 1 1 conv3/incep_splitncnn_3 conv4/incep0/conv 0=32 1=1 2=1 3=1 4=0 5=1 6=4096
BatchNorm        conv4/incep0/bn  1 1 conv4/incep0/conv conv4/incep0/conv_conv4/incep0/bn 0=32
Scale            conv4/incep0/bn_scale 1 1 conv4/incep0/conv_conv4/incep0/bn conv4/incep0/conv_conv4/incep0/bn_scale 0=32 1=1
ReLU             conv4/incep0/relu 1 1 conv4/incep0/conv_conv4/incep0/bn_scale conv4/incep0/conv_conv4/incep0/relu 0=0.000000
Convolution      conv4/incep1/conv1 1 1 conv3/incep_splitncnn_2 conv4/incep1/conv1 0=24 1=1 2=1 3=1 4=0 5=1 6=3072
BatchNorm        conv4/incep1/bn1 1 1 conv4/incep1/conv1 conv4/incep1/conv1_conv4/incep1/bn1 0=24
Scale            conv4/incep1/bn_scale1 1 1 conv4/incep1/conv1_conv4/incep1/bn1 conv4/incep1/conv1_conv4/incep1/bn_scale1 0=24 1=1
ReLU             conv4/incep1/relu1 1 1 conv4/incep1/conv1_conv4/incep1/bn_scale1 conv4/incep1/conv1_conv4/incep1/relu1 0=0.000000
Convolution      conv4/incep1/conv2 1 1 conv4/incep1/conv1_conv4/incep1/relu1 conv4/incep1/conv2 0=32 1=3 2=1 3=1 4=1 5=1 6=6912
BatchNorm        conv4/incep1/bn2 1 1 conv4/incep1/conv2 conv4/incep1/conv2_conv4/incep1/bn2 0=32
Scale            conv4/incep1/bn_scale2 1 1 conv4/incep1/conv2_conv4/incep1/bn2 conv4/incep1/conv2_conv4/incep1/bn_scale2 0=32 1=1
ReLU             conv4/incep1/relu2 1 1 conv4/incep1/conv2_conv4/incep1/bn_scale2 conv4/incep1/conv2_conv4/incep1/relu2 0=0.000000
Convolution      conv4/incep2/conv1 1 1 conv3/incep_splitncnn_1 conv4/incep2/conv1 0=24 1=1 2=1 3=1 4=0 5=1 6=3072
BatchNorm        conv4/incep2/bn1 1 1 conv4/incep2/conv1 conv4/incep2/conv1_conv4/incep2/bn1 0=24
Scale            conv4/incep2/bn_scale1 1 1 conv4/incep2/conv1_conv4/incep2/bn1 conv4/incep2/conv1_conv4/incep2/bn_scale1 0=24 1=1
ReLU             conv4/incep2/relu1 1 1 conv4/incep2/conv1_conv4/incep2/bn_scale1 conv4/incep2/conv1_conv4/incep2/relu1 0=0.000000
Convolution      conv4/incep2/conv2 1 1 conv4/incep2/conv1_conv4/incep2/relu1 conv4/incep2/conv2 0=32 1=3 2=1 3=1 4=1 5=1 6=6912
BatchNorm        conv4/incep2/bn2 1 1 conv4/incep2/conv2 conv4/incep2/conv2_conv4/incep2/bn2 0=32
Scale            conv4/incep2/bn_scale2 1 1 conv4/incep2/conv2_conv4/incep2/bn2 conv4/incep2/conv2_conv4/incep2/bn_scale2 0=32 1=1
ReLU             conv4/incep2/relu2 1 1 conv4/incep2/conv2_conv4/incep2/bn_scale2 conv4/incep2/conv2_conv4/incep2/relu2 0=0.000000
Convolution      conv4/incep2/conv3 1 1 conv4/incep2/conv2_conv4/incep2/relu2 conv4/incep2/conv3 0=32 1=3 2=1 3=1 4=1 5=1 6=9216
BatchNorm        conv4/incep2/bn3 1 1 conv4/incep2/conv3 conv4/incep2/conv3_conv4/incep2/bn3 0=32
Scale            conv4/incep2/bn_scale3 1 1 conv4/incep2/conv3_conv4/incep2/bn3 conv4/incep2/conv3_conv4/incep2/bn_scale3 0=32 1=1
ReLU             conv4/incep2/relu3 1 1 conv4/incep2/conv3_conv4/incep2/bn_scale3 conv4/incep2/conv3_conv4/incep2/relu3 0=0.000000
Pooling          conv4/incep3/pool 1 1 conv3/incep_splitncnn_0 conv4/incep3/pool 0=0 1=3 2=1 3=1 4=0
Convolution      conv4/incep3/conv 1 1 conv4/incep3/pool conv4/incep3/conv 0=32 1=1 2=1 3=1 4=0 5=1 6=4096
BatchNorm        conv4/incep3/bn  1 1 conv4/incep3/conv conv4/incep3/conv_conv4/incep3/bn 0=32
Scale            conv4/incep3/bn_scale 1 1 conv4/incep3/conv_conv4/incep3/bn conv4/incep3/conv_conv4/incep3/bn_scale 0=32 1=1
ReLU             conv4/incep3/relu 1 1 conv4/incep3/conv_conv4/incep3/bn_scale conv4/incep3/conv_conv4/incep3/relu 0=0.000000
Concat           conv4/incep      4 1 conv4/incep0/conv_conv4/incep0/relu conv4/incep1/conv2_conv4/incep1/relu2 conv4/incep2/conv3_conv4/incep2/relu3 conv4/incep3/conv_conv4/incep3/relu conv4/incep 0=0
Split            splitncnn_5      1 4 conv4/incep conv4/incep_splitncnn_0 conv4/incep_splitncnn_1 conv4/incep_splitncnn_2 conv4/incep_splitncnn_3
Convolution      conv5/incep0/conv 1 1 conv4/incep_splitncnn_3 conv5/incep0/conv 0=32 1=1 2=1 3=1 4=0 5=1 6=4096
BatchNorm        conv5/incep0/bn  1 1 conv5/incep0/conv conv5/incep0/conv_conv5/incep0/bn 0=32
Scale            conv5/incep0/bn_scale 1 1 conv5/incep0/conv_conv5/incep0/bn conv5/incep0/conv_conv5/incep0/bn_scale 0=32 1=1
ReLU             conv5/incep0/relu 1 1 conv5/incep0/conv_conv5/incep0/bn_scale conv5/incep0/conv_conv5/incep0/relu 0=0.000000
Convolution      conv5/incep1/conv1 1 1 conv4/incep_splitncnn_2 conv5/incep1/conv1 0=24 1=1 2=1 3=1 4=0 5=1 6=3072
BatchNorm        conv5/incep1/bn1 1 1 conv5/incep1/conv1 conv5/incep1/conv1_conv5/incep1/bn1 0=24
Scale            conv5/incep1/bn_scale1 1 1 conv5/incep1/conv1_conv5/incep1/bn1 conv5/incep1/conv1_conv5/incep1/bn_scale1 0=24 1=1
ReLU             conv5/incep1/relu1 1 1 conv5/incep1/conv1_conv5/incep1/bn_scale1 conv5/incep1/conv1_conv5/incep1/relu1 0=0.000000
Convolution      conv5/incep1/conv2 1 1 conv5/incep1/conv1_conv5/incep1/relu1 conv5/incep1/conv2 0=32 1=3 2=1 3=1 4=1 5=1 6=6912
BatchNorm        conv5/incep1/bn2 1 1 conv5/incep1/conv2 conv5/incep1/conv2_conv5/incep1/bn2 0=32
Scale            conv5/incep1/bn_scale2 1 1 conv5/incep1/conv2_conv5/incep1/bn2 conv5/incep1/conv2_conv5/incep1/bn_scale2 0=32 1=1
ReLU             conv5/incep1/relu2 1 1 conv5/incep1/conv2_conv5/incep1/bn_scale2 conv5/incep1/conv2_conv5/incep1/relu2 0=0.000000
Convolution      conv5/incep2/conv1 1 1 conv4/incep_splitncnn_1 conv5/incep2/conv1 0=24 1=1 2=1 3=1 4=0 5=1 6=3072
BatchNorm        conv5/incep2/bn1 1 1 conv5/incep2/conv1 conv5/incep2/conv1_conv5/incep2/bn1 0=24
Scale            conv5/incep2/bn_scale1 1 1 conv5/incep2/conv1_conv5/incep2/bn1 conv5/incep2/conv1_conv5/incep2/bn_scale1 0=24 1=1
ReLU             conv5/incep2/relu1 1 1 conv5/incep2/conv1_conv5/incep2/bn_scale1 conv5/incep2/conv1_conv5/incep2/relu1 0=0.000000
Convolution      conv5/incep2/conv2 1 1 conv5/incep2/conv1_conv5/incep2/relu1 conv5/incep2/conv2 0=32 1=3 2=1 3=1 4=1 5=1 6=6912
BatchNorm        conv5/incep2/bn2 1 1 conv5/incep2/conv2 conv5/incep2/conv2_conv5/incep2/bn2 0=32
Scale            conv5/incep2/bn_scale2 1 1 conv5/incep2/conv2_conv5/incep2/bn2 conv5/incep2/conv2_conv5/incep2/bn_scale2 0=32 1=1
ReLU             conv5/incep2/relu2 1 1 conv5/incep2/conv2_conv5/incep2/bn_scale2 conv5/incep2/conv2_conv5/incep2/relu2 0=0.000000
Convolution      conv5/incep2/conv3 1 1 conv5/incep2/conv2_conv5/incep2/relu2 conv5/incep2/conv3 0=32 1=3 2=1 3=1 4=1 5=1 6=9216
BatchNorm        conv5/incep2/bn3 1 1 conv5/incep2/conv3 conv5/incep2/conv3_conv5/incep2/bn3 0=32
Scale            conv5/incep2/bn_scale3 1 1 conv5/incep2/conv3_conv5/incep2/bn3 conv5/incep2/conv3_conv5/incep2/bn_scale3 0=32 1=1
ReLU             conv5/incep2/relu3 1 1 conv5/incep2/conv3_conv5/incep2/bn_scale3 conv5/incep2/conv3_conv5/incep2/relu3 0=0.000000
Pooling          conv5/incep3/pool 1 1 conv4/incep_splitncnn_0 conv5/incep3/pool 0=0 1=3 2=1 3=1 4=0
Convolution      conv5/incep3/conv 1 1 conv5/incep3/pool conv5/incep3/conv 0=32 1=1 2=1 3=1 4=0 5=1 6=4096
BatchNorm        conv5/incep3/bn  1 1 conv5/incep3/conv conv5/incep3/conv_conv5/incep3/bn 0=32
Scale            conv5/incep3/bn_scale 1 1 conv5/incep3/conv_conv5/incep3/bn conv5/incep3/conv_conv5/incep3/bn_scale 0=32 1=1
ReLU             conv5/incep3/relu 1 1 conv5/incep3/conv_conv5/incep3/bn_scale conv5/incep3/conv_conv5/incep3/relu 0=0.000000
Concat           conv5/incep      4 1 conv5/incep0/conv_conv5/incep0/relu conv5/incep1/conv2_conv5/incep1/relu2 conv5/incep2/conv3_conv5/incep2/relu3 conv5/incep3/conv_conv5/incep3/relu conv5/incep 0=0
Split            splitncnn_6      1 10 conv5/incep conv5/incep_splitncnn_0 conv5/incep_splitncnn_1 conv5/incep_splitncnn_2 conv5/incep_splitncnn_3 conv5/incep_splitncnn_4 conv5/incep_splitncnn_5 conv5/incep_splitncnn_6 conv5/incep_splitncnn_7 conv5/incep_splitncnn_8 conv5/incep_splitncnn_9
Convolution      Inception3/conv/loc1 1 1 conv5/incep_splitncnn_9 Inception3/conv/loc1 0=4 1=3 2=1 3=1 4=1 5=1 6=4608
Permute          Inception3/conv/loc1/perm 1 1 Inception3/conv/loc1 Inception3/conv/loc1/perm 0=3
Flatten          Inception3/conv/loc1/flat 1 1 Inception3/conv/loc1/perm Inception3/conv/loc1/flat
Convolution      Inception3/conv/conf1 1 1 conv5/incep_splitncnn_8 Inception3/conv/conf1 0=2 1=3 2=1 3=1 4=1 5=1 6=2304
Permute          Inception3/conv/conf1/perm 1 1 Inception3/conv/conf1 Inception3/conv/conf1/perm 0=3
Flatten          Inception3/conv/conf1/flat 1 1 Inception3/conv/conf1/perm Inception3/conv/conf1/flat
PriorBox         Inception3/conv/priorbox1 2 1 conv5/incep_splitncnn_7 data_splitncnn_4 Inception3/conv/priorbox1 -23300=1,32.000000 -23301=0 -23302=0 3=0.100000 4=0.100000 5=0.200000 6=0.200000 7=1 8=1 9=-233 10=-233 11=-233.000000 12=-233.000000 13=0.500000
Convolution      Inception3/conv/loc2 1 1 conv5/incep_splitncnn_6 Inception3/conv/loc2 0=4 1=3 2=1 3=1 4=1 5=1 6=4608
Permute          Inception3/conv/loc2/perm 1 1 Inception3/conv/loc2 Inception3/conv/loc2/perm 0=3
Flatten          Inception3/conv/loc2/flat 1 1 Inception3/conv/loc2/perm Inception3/conv/loc2/flat
Convolution      Inception3/conv/conf2 1 1 conv5/incep_splitncnn_5 Inception3/conv/conf2 0=2 1=3 2=1 3=1 4=1 5=1 6=2304
Permute          Inception3/conv/conf2/perm 1 1 Inception3/conv/conf2 Inception3/conv/conf2/perm 0=3
Flatten          Inception3/conv/conf2/flat 1 1 Inception3/conv/conf2/perm Inception3/conv/conf2/flat
PriorBox         Inception3/conv/priorbox2 2 1 conv5/incep_splitncnn_4 data_splitncnn_3 Inception3/conv/priorbox2 -23300=1,64.000000 -23301=0 -23302=0 3=0.100000 4=0.100000 5=0.200000 6=0.200000 7=1 8=1 9=-233 10=-233 11=-233.000000 12=-233.000000 13=0.500000
Convolution      Inception3/conv/loc3 1 1 conv5/incep_splitncnn_3 Inception3/conv/loc3 0=4 1=3 2=1 3=1 4=1 5=1 6=4608
Permute          Inception3/conv/loc3/perm 1 1 Inception3/conv/loc3 Inception3/conv/loc3/perm 0=3
Flatten          Inception3/conv/loc3/flat 1 1 Inception3/conv/loc3/perm Inception3/conv/loc3/flat
Convolution      Inception3/conv/conf3 1 1 conv5/incep_splitncnn_2 Inception3/conv/conf3 0=2 1=3 2=1 3=1 4=1 5=1 6=2304
Permute          Inception3/conv/conf3/perm 1 1 Inception3/conv/conf3 Inception3/conv/conf3/perm 0=3
Flatten          Inception3/conv/conf3/flat 1 1 Inception3/conv/conf3/perm Inception3/conv/conf3/flat
PriorBox         Inception3/conv/priorbox3 2 1 conv5/incep_splitncnn_1 data_splitncnn_2 Inception3/conv/priorbox3 -23300=1,128.000000 -23301=0 -23302=0 3=0.100000 4=0.100000 5=0.200000 6=0.200000 7=1 8=1 9=-233 10=-233 11=-233.000000 12=-233.000000 13=0.500000
Convolution      conv6_1          1 1 conv5/incep_splitncnn_0 conv6_1 0=128 1=1 2=1 3=1 4=0 5=1 6=16384
BatchNorm        conv6/bn1        1 1 conv6_1 conv6_1_conv6/bn1 0=128
Scale            conv6/bn_scale1  1 1 conv6_1_conv6/bn1 conv6_1_conv6/bn_scale1 0=128 1=1
ReLU             conv6/relu1      1 1 conv6_1_conv6/bn_scale1 conv6_1_conv6/relu1 0=0.000000
Convolution      conv6_2          1 1 conv6_1_conv6/relu1 conv6_2 0=256 1=3 2=1 3=2 4=1 5=1 6=294912
BatchNorm        conv6/bn2        1 1 conv6_2 conv6_2_conv6/bn2 0=256
Scale            conv6/bn_scale2  1 1 conv6_2_conv6/bn2 conv6_2_conv6/bn_scale2 0=256 1=1
ReLU             conv6/relu2      1 1 conv6_2_conv6/bn_scale2 conv6_2_conv6/relu2 0=0.000000
Split            splitncnn_7      1 4 conv6_2_conv6/relu2 conv6_2_conv6/relu2_splitncnn_0 conv6_2_conv6/relu2_splitncnn_1 conv6_2_conv6/relu2_splitncnn_2 conv6_2_conv6/relu2_splitncnn_3
Convolution      conv6/loc        1 1 conv6_2_conv6/relu2_splitncnn_3 conv6/loc 0=4 1=3 2=1 3=1 4=1 5=1 6=9216
Permute          conv6/loc/perm   1 1 conv6/loc conv6/loc/perm 0=3
Flatten          conv6/loc/perm/flat 1 1 conv6/loc/perm conv6/loc/perm/flat
Convolution      conv6/conf       1 1 conv6_2_conv6/relu2_splitncnn_2 conv6/conf 0=2 1=3 2=1 3=1 4=1 5=1 6=4608
Permute          conv6/conf/perm  1 1 conv6/conf conv6/conf/perm 0=3
Flatten          conv6/conf/perm/flat 1 1 conv6/conf/perm conv6/conf/perm/flat
PriorBox         conv6/priorbox   2 1 conv6_2_conv6/relu2_splitncnn_1 data_splitncnn_1 conv6/priorbox -23300=1,256.000000 -23301=0 -23302=0 3=0.100000 4=0.100000 5=0.200000 6=0.200000 7=1 8=1 9=-233 10=-233 11=-233.000000 12=-233.000000 13=0.500000
Convolution      conv7_1          1 1 conv6_2_conv6/relu2_splitncnn_0 conv7_1 0=128 1=1 2=1 3=1 4=0 5=1 6=32768
BatchNorm        conv7/bn1        1 1 conv7_1 conv7_1_conv7/bn1 0=128
Scale            conv7/bn_scale1  1 1 conv7_1_conv7/bn1 conv7_1_conv7/bn_scale1 0=128 1=1
ReLU             conv7/relu1      1 1 conv7_1_conv7/bn_scale1 conv7_1_conv7/relu1 0=0.000000
Convolution      conv7_2          1 1 conv7_1_conv7/relu1 conv7_2 0=256 1=3 2=1 3=2 4=1 5=1 6=294912
BatchNorm        conv7/bn2        1 1 conv7_2 conv7_2_conv7/bn2 0=256
Scale            conv7/bn_scale2  1 1 conv7_2_conv7/bn2 conv7_2_conv7/bn_scale2 0=256 1=1
ReLU             conv7/relu2      1 1 conv7_2_conv7/bn_scale2 conv7_2_conv7/relu2 0=0.000000
Split            splitncnn_8      1 3 conv7_2_conv7/relu2 conv7_2_conv7/relu2_splitncnn_0 conv7_2_conv7/relu2_splitncnn_1 conv7_2_conv7/relu2_splitncnn_2
Convolution      conv7/loc        1 1 conv7_2_conv7/relu2_splitncnn_2 conv7/loc 0=4 1=3 2=1 3=1 4=1 5=1 6=9216
Permute          conv7/loc/perm   1 1 conv7/loc conv7/loc/perm 0=3
Flatten          conv7/loc/perm/flat 1 1 conv7/loc/perm conv7/loc/perm/flat
Convolution      conv7/conf       1 1 conv7_2_conv7/relu2_splitncnn_1 conv7/conf 0=2 1=3 2=1 3=1 4=1 5=1 6=4608
Permute          conv7/conf/perm  1 1 conv7/conf conv7/conf/perm 0=3
Flatten          conv7/conf/perm/flat 1 1 conv7/conf/perm conv7/conf/perm/flat
PriorBox         conv7/priorbox   2 1 conv7_2_conv7/relu2_splitncnn_0 data_splitncnn_0 conv7/priorbox -23300=1,512.000000 -23301=0 -23302=0 3=0.100000 4=0.100000 5=0.200000 6=0.200000 7=1 8=1 9=-233 10=-233 11=-233.000000 12=-233.000000 13=0.500000
Concat           mbox_loc         5 1 Inception3/conv/loc1/flat Inception3/conv/loc2/flat Inception3/conv/loc3/flat conv6/loc/perm/flat conv7/loc/perm/flat mbox_loc 0=0
Concat           mbox_conf        5 1 Inception3/conv/conf1/flat Inception3/conv/conf2/flat Inception3/conv/conf3/flat conv6/conf/perm/flat conv7/conf/perm/flat mbox_conf 0=0
Concat           mbox_priorbox    5 1 Inception3/conv/priorbox1 Inception3/conv/priorbox2 Inception3/conv/priorbox3 conv6/priorbox conv7/priorbox mbox_priorbox 0=1
DetectionOutput  detection_out    3 1 mbox_loc mbox_conf mbox_priorbox detection_out 0=2 1=0.450000 2=100 3=100 4=0.500000
